import React from "react";
import QuestionAns from "./QuestionAns";

const Blog = () => {
  return (
    <>
      <div className="w-full flex flex justify-center items-center">
        <div className="w-8/12">
          <QuestionAns 
            question="Context API কি?"
            answer="আমরা সাধারনত এক কম্পোনেন্ট থেকে অন্য কম্পোনেন্টে যখন কোন ডাটা
            শেয়ার করে থাকি তখন props এর মাধ্যমে তা পাস করে থাকি সেটা যদি ১০০
            নাম্বার কম্পোনেন্টও হয় তাহলেও প্রতিটি কম্পোনেন্টের মাধ্যমে তা পাস
            করে পাঠাতে হয় কিন্তু Context API দিয়ে ReactJs এ এক কম্পোনেন্ট থেকে
            অন্য কম্পোনেন্টে কোন প্রকার props পাস করা ছাড়াই যে কোন ধরনের ডাটা
            পাঠানো যায় । context api এতটাই পাওয়ারফুল যে এর মাধ্যমে state,
            function ইত্যাদিও পাঠানো যায় এবং খুব সহযেই যে কোন কম্পোনেন্ট থেকে
            তা রিসিব করা যায় এবং ব্যাবহার করা যায় ।"
          />
          <QuestionAns 
            question="Context API কি?"
            answer="আমরা সাধারনত এক কম্পোনেন্ট থেকে অন্য কম্পোনেন্টে যখন কোন ডাটা
            শেয়ার করে থাকি তখন props এর মাধ্যমে তা পাস করে থাকি সেটা যদি ১০০
            নাম্বার কম্পোনেন্টও হয় তাহলেও প্রতিটি কম্পোনেন্টের মাধ্যমে তা পাস
            করে পাঠাতে হয় কিন্তু Context API দিয়ে ReactJs এ এক কম্পোনেন্ট থেকে
            অন্য কম্পোনেন্টে কোন প্রকার props পাস করা ছাড়াই যে কোন ধরনের ডাটা
            পাঠানো যায় । context api এতটাই পাওয়ারফুল যে এর মাধ্যমে state,
            function ইত্যাদিও পাঠানো যায় এবং খুব সহযেই যে কোন কম্পোনেন্ট থেকে
            তা রিসিব করা যায় এবং ব্যাবহার করা যায় ।"
          />
        </div>
      </div>
    </>
  );
};

export default Blog;