export const QnaDetails = [
    {
        id:1,
        question:"Context API কি?",
        answer:`আমরা সাধারনত এক কম্পোনেন্ট থেকে অন্য কম্পোনেন্টে যখন কোন ডাটা
            শেয়ার করে থাকি তখন props এর মাধ্যমে তা পাস করে থাকি সেটা যদি ১০০
            নাম্বার কম্পোনেন্টও হয় তাহলেও প্রতিটি কম্পোনেন্টের মাধ্যমে তা পাস
            করে পাঠাতে হয় কিন্তু Context API দিয়ে ReactJs এ এক কম্পোনেন্ট থেকে
            অন্য কম্পোনেন্টে কোন প্রকার props পাস করা ছাড়াই যে কোন ধরনের ডাটা
            পাঠানো যায় । context api এতটাই পাওয়ারফুল যে এর মাধ্যমে state,
            function ইত্যাদিও পাঠানো যায় এবং খুব সহযেই যে কোন কম্পোনেন্ট থেকে
            তা রিসিব করা যায় এবং ব্যাবহার করা যায় ।`
    },
    {
        id:2,
        question:"Semantics Tag কি?",
        answer:`Semantic Tag হচ্ছে HTML এ অর্থপূর্ণ ট্যগ যার মাধ্যমে আমরা আমাদের কোডগুলোকে খুব সহযেই organized করতে পারি। non-semantic ট্যগ ব্যবহার করলে কোড গুলো একটু অগোছালো থেকে যায়। যেমন semantic ট্যগ এ আমরা যখন Navigation বার তৈরি করি তখন আমরা Nav Tag ব্যাবহার করি যার মাধ্যমে খুব সহযেই বুঝা যাচ্ছে যে এটি একটি Navigation বার কিন্তু non-semantic ট্যাগ এ আমরা Div ব্যাবহার করে থাকি যার কারনে কোড অনেকটা অগোছালো দেখায় । এছাড়াও অনেক semantic ট্যাগ রয়েছে যার মাধ্যমে আমরা আমাদের কোড গুলো খুব সহযেই একটি পুর্ণ গোছালো রূপ দিতে পারি।`
    },
    {
        id:3,
        question:"inline vs inline block elements",
        answer:`HTML এলিমেন্ট সাধারনত ২ ধরনের হয় inline এলিমেন্ট এবং inline block এলিমেন্ট। block এলিমেন্ট গুলো একটি লাইনের সম্পুর্ন জায়গা দখল করে থাকে আর Inline এলিমেন্ট গুলো শুধু মাত্র তার প্রয়োজনিয় জায়গা টুকু নেয় তাই অন্য সকল Inline এলিমেন্ট একটার পর একটা বসতে থাকে। যেমন block এলিমেন্ট গুলো (Div, p, section, h1-h6) ট্যাগ ইত্যাদি এবং Iline এলিমেন্ট গুলো (a, span, strong, q) ট্যাগ ইত্যাদি। যেমন কোন একটি প্যারাগ্রাফের টেক্সট কোন প্রকার হাইলাইট বা কোন প্রকার স্টাইল ব্যাবহার করার জন্য আমরা span ট্যাগ ব্যাবহার করে থাকি এছাড়াও আরো অনেক উপায়ে এগুলোকে ব্যাবহার করা যায়।`
    },
]